Revit 2024 API
ParameterTypeId.CurveDeterminesOrientation Property
 "Determines Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CurveDeterminesOrientation { get; }
Visual Basic
Public Shared ReadOnly Property CurveDeterminesOrientation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurveDeterminesOrientation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace